In [61]:
from sqlalchemy import create_engine
import pandas as pd
import psycopg2

In [62]:
engine = create_engine("postgresql://postgres:manager@10.0.6.3:5432/cbs", connect_args={'options': '-csearch_path={}'.format('cbs_emlak')})

In [63]:
con = engine.connect()

In [64]:
engine.table_names()

/var/folders/p1/mbkl10792jz1k5zgkw1zd_mh0000gn/T/ipykernel_3768/4162273999.py:1: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  engine.table_names()

['city',
 'district',
 'region_city',
 'neighbourhood',
 'region',
 'deed',
 'campus',
 'log',
 'type_spec',
 'real_estate',
 'file',
 'folder',
 'independent_section']

In [5]:
# Specify SQL query
query = "Delete FROM independent_section"

# Connect to database and execute query
with engine.connect() as con:
    df = pd.read_sql_query(query, con)

# Print out head of dataframe
df.head()

ResourceClosedError: This result object does not return rows. It has been closed automatically.

In [6]:
emlakverileri = pd.read_excel(r'/Users/aliosmanyilmaz/Downloads/emlakverileri.xlsx');
emlakverileri.head()

/Users/aliosmanyilmaz/opt/anaconda3/lib/python3.9/site-packages/openpyxl/worksheet/_read_only.py:79: UserWarning: Web Extension extension is not supported and will be removed
  for idx, row in parser.parse():

,LocID,User,Project,Part,Lat,Long,Start,Stop,Facility Code,Hiyerarşi,...,Sütun7,HType,LStatus,PicInfo,LastFlag,LastTS,Region,Code8,Sütun8,Sütun9
0,20470,102,TCDD,FAZ-1,38.077677,30.208332,30/04/2021 13:41:41,30/04/2021 13:43:43,90000304,90000304,...,NaN,T-TCDD,FAAL,LO-TCDD-FAZ-1-102-20210430134141,NaN,NaN,7.BÖLGE,NaN,NaN,NaN
1,20471,101,TCDD,FAZ-1,38.077677,30.208332,30/04/2021 13:41:41,30/04/2021 13:47:47,90000304,90000304-90000320,...,NaN,T-TCDD,FAAL,LO-TCDD-FAZ-1-101-20210430134141,NaN,NaN,7.BÖLGE,NaN,NaN,NaN
2,20485,101,TCDD,FAZ-1,38.07752252,30.2082382,30/04/2021 14:40:40,30/04/2021 14:50:50,90000304,90000304-90000320-90000194,...,NaN,T-TCDD,FAAL,LO-TCDD-FAZ-1-101-20210430144040,NaN,NaN,7.BÖLGE,NaN,NaN,NaN
3,20488,101,TCDD,FAZ-1,38.0776306666667,30.2079466666667,30/04/2021 14:51:51,30/04/2021 14:52:52,90000304,90000304-90000320-90000194-90000188,...,NaN,T-TCDD,FAAL,LO-TCDD-FAZ-1-101-20210430145151,NaN,NaN,7.BÖLGE,NaN,NaN,NaN
4,20487,101,TCDD,FAZ-1,38.0776306666667,30.2079466666667,30/04/2021 14:50:50,30/04/2021 14:51:51,90000304,90000304-90000320-90000194-90000380,...,NaN,T-TCDD,FAAL,LO-TCDD-FAZ-1-101-20210430145050,NaN,NaN,7.BÖLGE,NaN,NaN,NaN

In [7]:
#Şehirleri sql'e ekle

cities=["Adana", "Adıyaman", "Afyon", "Ağrı", "Amasya", "Ankara", "Antalya", "Artvin", "Aydın", "Balıkesir", "Bilecik", "Bingöl", "Bitlis", "Bolu", "Burdur", "Bursa", "Çanakkale", "Çankırı", "Çorum", "Denizli", "Diyarbakır", "Edirne", "Elazığ", "Erzincan", "Erzurum", "Eskişehir", "Gaziantep", "Giresun", "Gümüşhane", "Hakkari", "Hatay", "Isparta", "İçel (Mersin)", "İstanbul", "İzmir", "Kars", "Kastamonu", "Kayseri", "Kırklareli", "Kırşehir", "Kocaeli", "Konya", "Kütahya", "Malatya", "Manisa", "Kahramanmaraş", "Mardin", "Muğla", "Muş", "Nevşehir", "Niğde", "Ordu", "Rize", "Sakarya", "Samsun", "Siirt", "Sinop", "Sivas", "Tekirdağ", "Tokat", "Trabzon", "Tunceli", "Şanlıurfa", "Uşak", "Van", "Yozgat", "Zonguldak", "Aksaray", "Bayburt", "Karaman", "Kırıkkale", "Batman", "Şırnak", "Bartın", "Ardahan", "Iğdır", "Yalova", "Karabük", "Kilis", "Osmaniye", "Düzce"
]

cities = {'Name': cities}
cities = pd.DataFrame(cities)
cities.index += 1
cities

        Name
1      Adana
2   Adıyaman
3      Afyon
4       Ağrı
5     Amasya
..       ...
77    Yalova
78   Karabük
79     Kilis
80  Osmaniye
81     Düzce

[81 rows x 1 columns]

In [84]:
cities.to_sql('city',con=engine, if_exists='append', index_label='id')

81

In [16]:
#Regionları ekle

regions = emlakverileri["Region"].unique()
regions = {'name': regions}
regions = pd.DataFrame(regions)
regions = regions.sort_values(by=['name']).dropna()
regions.reset_index(inplace=True)
regions = regions[["name"]]
regions.index += 1

regions

            name
1        1.BÖLGE
2        2.BÖLGE
3        3.BÖLGE
4        4.BÖLGE
5        6.BÖLGE
6        7.BÖLGE
7  8.BÖLGE (YHT)
8    BASKENT RAY

In [246]:
regions.to_sql('region',con=engine, if_exists='append', index_label='id')

8

In [85]:
ilceler = pd.read_excel(r'/Users/aliosmanyilmaz/Downloads/il_ilceler.xlsx',sheet_name='Ilceler');
ilceler.index += 1
ilceler.to_sql('district',con=engine, if_exists='append', index=False)

970

In [22]:
ilceler = pd.read_excel(r'/Users/aliosmanyilmaz/Downloads/il_ilceler.xlsx',sheet_name='Ilceler');
ilceler = ilceler[["Name", "id"]]
ilceler["Name"] = ilceler["Name"].str.strip()
ilceler.index += 1
ilceler.head()

        Name  id
1     Seyhan   1
2     Ceyhan   2
3       Feke   3
4  Karaisalı   4
5    Karataş   5

In [20]:
mahalle = pd.read_excel(r'/Users/aliosmanyilmaz/Downloads/mahalle.xlsx');
mahalle.index += 1
mahalle["Name"] = mahalle["Name"].str.title()
mahalle = mahalle[["Name", "MAHALLE"]]
mahalle["Name"] = mahalle["Name"].str.strip()
mahalle

         Name                                            MAHALLE
1      Aladağ  AKPINAR MAH                                   ...
2      Aladağ  BAŞPINAR MAH                                  ...
3      Aladağ  MANSURLU MAH                                  ...
4      Aladağ  SİNANPAŞA MAH                                 ...
5      Aladağ  AKÖREN MAH                                    ...
...       ...                                                ...
73275  Merkez  TEPEBAŞI MAH                                  ...
73276  Merkez  TERAKKİ MAH                                   ...
73277  Merkez  YAYLA MAH                                     ...
73278  Merkez  YENİ MAH                                      ...
73279  Merkez  YEŞİL MAH                                     ...

[73279 rows x 2 columns]

In [23]:
mahalle = pd.merge(mahalle,ilceler,on='Name')
mahalle

         Name                                            MAHALLE   id
0      Aladağ  AKPINAR MAH                                   ...   12
1      Aladağ  BAŞPINAR MAH                                  ...   12
2      Aladağ  MANSURLU MAH                                  ...   12
3      Aladağ  SİNANPAŞA MAH                                 ...   12
4      Aladağ  AKÖREN MAH                                    ...   12
...       ...                                                ...  ...
30061   Kozlu  YENİ MAH (ÖRENCİK KÖYÜ)                       ...  887
30062   Kozlu  YUKARI İHSANİYE MAH (KOZLUKÖY KÖYÜ)           ...  887
30063   Kozlu  YUKARI MAH (AKŞEYH KÖYÜ)                      ...  887
30064   Kozlu  YUKARI MAH (ÇIRGAN KÖYÜ)                      ...  887
30065   Kozlu  YUKARI MAH (UZUNGÜNEY KÖYÜ)                   ...  887

[30066 rows x 3 columns]

In [90]:
mahalle = mahalle[["MAHALLE", "id"]]

In [91]:
mahalle = mahalle.rename(columns={'MAHALLE': 'name', 'id': 'district_id'})
mahalle.head()

                                                name  district_id
0  AKPINAR MAH                                   ...           12
1  BAŞPINAR MAH                                  ...           12
2  MANSURLU MAH                                  ...           12
3  SİNANPAŞA MAH                                 ...           12
4  AKÖREN MAH                                    ...           12

In [92]:
mahalle.to_sql('neighbourhood',con=engine, if_exists='append', index_label='id')

66

In [97]:
#region_city

region_city = emlakverileri[["City", "Region"]]
region_city = region_city.drop_duplicates()
region_city = region_city.reset_index()
region_city = region_city[["City", "Region"]]
region_city = region_city.rename(columns = {'City':'Name'})
region_city["Name"] = region_city["Name"].str.lower().str.upper()
region_city

              Name         Region
0   AFYONKARAHISAR        7.BÖLGE
1           ANKARA        2.BÖLGE
2           ANKARA    BASKENT RAY
3           ANKARA  8.BÖLGE (YHT)
4        BALIKESIR        7.BÖLGE
5        BALIKESIR        3.BÖLGE
6           BURDUR        7.BÖLGE
7            BURSA        7.BÖLGE
8          CANKIRI        2.BÖLGE
9          DENIZLI        7.BÖLGE
10         DENIZLI        3.BÖLGE
11       ESKISEHIR        7.BÖLGE
12       ESKISEHIR        2.BÖLGE
13       ESKISEHIR  8.BÖLGE (YHT)
14       ESKISEHIR        1.BÖLGE
15         ISPARTA        7.BÖLGE
16         KARABUK        2.BÖLGE
17         KAYSERI        2.BÖLGE
18         KAYSERI        4.BÖLGE
19       KIRIKKALE        2.BÖLGE
20       KIRIKKALE  8.BÖLGE (YHT)
21       KIRIKKALE            NaN
22        KIRSEHIR        2.BÖLGE
23           KONYA        7.BÖLGE
24           KONYA  8.BÖLGE (YHT)
25           KONYA        6.BÖLGE
26           KONYA            NaN
27         KUTAHYA        7.BÖLGE
28        NEVSEHIR        2.BÖLGE
29           NIGDE        2.BÖLGE
30           NIGDE        6.BÖLGE
31            USAK        3.BÖLGE
32          YOZGAT        2.BÖLGE
33          YOZGAT  8.BÖLGE (YHT)
34       ZONGULDAK        2.BÖLGE

In [98]:
#Şehirleri sql'e ekle

cities=["Adana", "Adıyaman", "Afyonkarahisar", "Agri", "Amasya", "Ankara", "Antalya", "Artvin", "Aydın", "Balikesir", "Bilecik", "Bingöl", "Bitlis", "Bolu", "Burdur", "Bursa", "Canakkale", "Cankırı", "Corum", "Denizli", "Diyarbakir", "Edirne", "Elazıg", "Erzincan", "Erzurum", "Eskisehir", "Gaziantep", "Giresun", "Gümüshane", "Hakkari", "Hatay", "Isparta", "icel (Mersin)", "istanbul", "izmir", "Kars", "Kastamonu", "Kayseri", "Kirklareli", "Kirşehir", "Kocaeli", "Konya", "Kutahya", "Malatya", "Manisa", "Kahramanmaras", "Mardin", "Mugla", "Mus", "Nevsehir", "Nigde", "Ordu", "Rize", "Sakarya", "Samsun", "Siirt", "Sinop", "Sivas", "Tekirdag", "Tokat", "Trabzon", "Tunceli", "Sanlıurfa", "Usak", "Van", "Yozgat", "Zonguldak", "Aksaray", "Bayburt", "Karaman", "Kirikkale", "Batman", "Sirnak", "Bartın", "Ardahan", "Igdır", "Yalova", "Karabük", "Kilis", "Osmaniye", "Düzce"
]

cities = {'Name': cities}
cities = pd.DataFrame(cities)
cities.index += 1

cities.reset_index(inplace=True)
cities = cities.rename(columns = {'index':'city_id'})
cities["Name"] = cities["Name"].str.lower().str.upper()
cities

    city_id            Name
0         1           ADANA
1         2        ADIYAMAN
2         3  AFYONKARAHISAR
3         4            AGRI
4         5          AMASYA
..      ...             ...
76       77          YALOVA
77       78         KARABÜK
78       79           KILIS
79       80        OSMANIYE
80       81           DÜZCE

[81 rows x 2 columns]

In [99]:
region_city = region_city.rename(columns={'City': 'Name'})
region_city = region_city.drop_duplicates()

In [262]:
region_city = pd.merge(cities,region_city,on='Name')

In [263]:
region_city

    city_id       Name         Region
0         6     Ankara        2.BÖLGE
1         6     Ankara    BASKENT RAY
2         6     Ankara  8.BÖLGE (YHT)
3        20     Burdur        7.BÖLGE
4        21      Bursa        7.BÖLGE
5        22    Denizli        7.BÖLGE
6        22    Denizli        3.BÖLGE
7        35    Isparta        7.BÖLGE
8        42    Kayseri        2.BÖLGE
9        42    Kayseri        4.BÖLGE
10       45      Konya        7.BÖLGE
11       45      Konya  8.BÖLGE (YHT)
12       45      Konya        6.BÖLGE
13       45      Konya            NaN
14       72     Yozgat        2.BÖLGE
15       72     Yozgat  8.BÖLGE (YHT)
16       73  Zonguldak        2.BÖLGE

In [238]:
regions.head()

      name
5  1.BÖLGE
1  2.BÖLGE
4  3.BÖLGE
6  4.BÖLGE
8  6.BÖLGE

In [218]:
region_city = pd.merge(region_city,regions,on='Name')

In [13]:
facility = emlakverileri[["Facility", "Region"]]

In [14]:
facility.head()

   Facility   Region
0  KARAKUYU  7.BÖLGE
1  KARAKUYU  7.BÖLGE
2  KARAKUYU  7.BÖLGE
3  KARAKUYU  7.BÖLGE
4  KARAKUYU  7.BÖLGE

In [27]:
regions = emlakverileri["Region"].unique()
regions = {'name': regions}
regions = pd.DataFrame(regions)
regions.dropna()
regions = regions.sort_values(by=['name']).dropna()
regions.reset_index(inplace=True)
regions = regions[["name"]]
regions.index += 1
regions

            name
1        1.BÖLGE
2        2.BÖLGE
3        3.BÖLGE
4        4.BÖLGE
5        6.BÖLGE
6        7.BÖLGE
7  8.BÖLGE (YHT)
8    BASKENT RAY

In [28]:
facility = emlakverileri[["Facility", "Region"]]
facility = facility.drop_duplicates()
facility = facility.reset_index()
facility = facility[["Facility", "Region"]]
regions = regions.reset_index()
facility = regions.merge(facility, left_on="name", right_on="Region")
facility = facility[["index", "Facility"]]

In [36]:
facility = facility.rename(columns={'Facility': 'name', "index":"region_id"})
facility

     region_id                 name
0            1             INONU-1B
1            2  BEHICBEY RAY KAYNAK
2            2         DEMIRLIBAHCE
3            2                NENEK
4            2            ETIMESGUT
..         ...                  ...
386          8              OZGUNES
387          8              ERYAMAN
388          8           SAIMEKADIN
389          8                 GAZI
390          8           ANKARA GAR

[391 rows x 2 columns]

In [37]:
facility.to_sql('campus',con=engine, if_exists='append', index_label='id')

391

In [43]:
#Type_Spec
typ = emlakverileri[["Type"]].drop_duplicates()
typ = typ.reset_index()
typ = typ[["Type"]]
typ = typ.rename(columns={'Type': 'name'})
typ.index += 1

typ

          name
1         0IST
2         0BIN
3          KAT
4         OFIS
5       KMRLUK
..         ...
140      RPPER
141  SNTRALODS
142       0TES
143      TRAFO
144  AKRYKTIST

[144 rows x 1 columns]

In [44]:
typ.to_sql('type_spec',con=engine, if_exists='append', index_label='id')

144

In [221]:
emlakverileri = pd.read_excel(r'/Users/aliosmanyilmaz/Downloads/emlakverileri.xlsx');

/Users/aliosmanyilmaz/opt/anaconda3/lib/python3.9/site-packages/openpyxl/worksheet/_read_only.py:79: UserWarning: Web Extension extension is not supported and will be removed
  for idx, row in parser.parse():

In [665]:
independent_section = emlakverileri[["Type", "Code", "ParentCode", "Region", "LocName"]]
independent_section = independent_section.astype({"ParentCode": 'Int64'})
independent_section = independent_section.astype({"ParentCode": 'str', "Code":'str'})
independent_section.index += 1
independent_section = independent_section.reset_index(names='id')
independent_section

          id    Type      Code ParentCode   Region               LocName
0          1    0IST  90000304       <NA>  7.BÖLGE        KARAKUYU TESIS
1          2    0BIN  90000320   90000304  7.BÖLGE            GAR BINASI
2          3     KAT  90000194   90000320  7.BÖLGE                KAT: 1
3          4    OFIS  90000188   90000194  7.BÖLGE            YEDEK OFIS
4          5    OFIS  90000380   90000194  7.BÖLGE            YEDEK OFIS
...      ...     ...       ...        ...      ...                   ...
26340  26341  KNTYNR  90027484   90004209  2.BÖLGE       SHELTER 395+175
26341  26342  KNTYNR  90027485   90004209  2.BÖLGE       SHELTER 390+336
26342  26343    0IST  90004210       <NA>  2.BÖLGE              GOKCELER
26343  26344   SALON  90004184   90004210  2.BÖLGE  YOLCU BEKLEME SALONU
26344  26345   PERON  90004207   90004210  2.BÖLGE                 PERON

[26345 rows x 6 columns]

In [666]:
independent_section2 = independent_section[["Code", "LocName"]]
independent_section2.index += 1
independent_section2 = independent_section2.reset_index()
independent_section2

       index      Code               LocName
0          1  90000304        KARAKUYU TESIS
1          2  90000320            GAR BINASI
2          3  90000194                KAT: 1
3          4  90000188            YEDEK OFIS
4          5  90000380            YEDEK OFIS
...      ...       ...                   ...
26340  26341  90027484       SHELTER 395+175
26341  26342  90027485       SHELTER 390+336
26342  26343  90004210              GOKCELER
26343  26344  90004184  YOLCU BEKLEME SALONU
26344  26345  90004207                 PERON

[26345 rows x 3 columns]

In [667]:
merged = independent_section.merge(independent_section2, left_on="ParentCode", right_on="Code", how="left")

merged

,id,Type,Code_x,ParentCode,Region,LocName_x,index,Code_y,LocName_y
0,1,0IST,90000304,<NA>,7.BÖLGE,KARAKUYU TESIS,NaN,NaN,NaN
1,2,0BIN,90000320,90000304,7.BÖLGE,GAR BINASI,1.0,90000304,KARAKUYU TESIS
2,3,KAT,90000194,90000320,7.BÖLGE,KAT: 1,2.0,90000320,GAR BINASI
3,4,OFIS,90000188,90000194,7.BÖLGE,YEDEK OFIS,3.0,90000194,KAT: 1
4,5,OFIS,90000380,90000194,7.BÖLGE,YEDEK OFIS,3.0,90000194,KAT: 1
...,...,...,...,...,...,...,...,...,...
26340,26341,KNTYNR,90027484,90004209,2.BÖLGE,SHELTER 395+175,26252.0,90004209,FILYOS
26341,26342,KNTYNR,90027485,90004209,2.BÖLGE,SHELTER 390+336,26252.0,90004209,FILYOS
26342,26343,0IST,90004210,<NA>,2.BÖLGE,GOKCELER,NaN,NaN,NaN
26343,26344,SALON,90004184,90004210,2.BÖLGE,YOLCU BEKLEME SALONU,26343.0,90004210,GOKCELER
26344,26345,PERON,90004207,90004210,2.BÖLGE,PERON,26343.0,90004210,GOKCELER

In [668]:
merged = merged.sort_values("id")
merged = merged.rename(columns={'Code_x': 'ref_code', "LocName_x":"name", "index":"parent_id"})
merged

,id,Type,ref_code,ParentCode,Region,name,parent_id,Code_y,LocName_y
0,1,0IST,90000304,<NA>,7.BÖLGE,KARAKUYU TESIS,NaN,NaN,NaN
1,2,0BIN,90000320,90000304,7.BÖLGE,GAR BINASI,1.0,90000304,KARAKUYU TESIS
2,3,KAT,90000194,90000320,7.BÖLGE,KAT: 1,2.0,90000320,GAR BINASI
3,4,OFIS,90000188,90000194,7.BÖLGE,YEDEK OFIS,3.0,90000194,KAT: 1
4,5,OFIS,90000380,90000194,7.BÖLGE,YEDEK OFIS,3.0,90000194,KAT: 1
...,...,...,...,...,...,...,...,...,...
26340,26341,KNTYNR,90027484,90004209,2.BÖLGE,SHELTER 395+175,26252.0,90004209,FILYOS
26341,26342,KNTYNR,90027485,90004209,2.BÖLGE,SHELTER 390+336,26252.0,90004209,FILYOS
26342,26343,0IST,90004210,<NA>,2.BÖLGE,GOKCELER,NaN,NaN,NaN
26343,26344,SALON,90004184,90004210,2.BÖLGE,YOLCU BEKLEME SALONU,26343.0,90004210,GOKCELER
26344,26345,PERON,90004207,90004210,2.BÖLGE,PERON,26343.0,90004210,GOKCELER

In [669]:
#Type_Spec
typ = emlakverileri[["Type"]].drop_duplicates()
typ = typ.reset_index(names='type_spec_id')
typ = typ[["Type"]]
typ = typ.rename(columns={'Type': 'name'})
typ.index += 1

typ = typ.reset_index()

In [670]:
merged = merged.merge(typ, left_on="Type", right_on="name", how="left")
merged = merged.rename(columns={'index': 'type_spec_id'})

merged

,id,Type,ref_code,ParentCode,Region,name_x,parent_id,Code_y,LocName_y,type_spec_id,name_y
0,1,0IST,90000304,<NA>,7.BÖLGE,KARAKUYU TESIS,NaN,NaN,NaN,1,0IST
1,2,0BIN,90000320,90000304,7.BÖLGE,GAR BINASI,1.0,90000304,KARAKUYU TESIS,2,0BIN
2,3,KAT,90000194,90000320,7.BÖLGE,KAT: 1,2.0,90000320,GAR BINASI,3,KAT
3,4,OFIS,90000188,90000194,7.BÖLGE,YEDEK OFIS,3.0,90000194,KAT: 1,4,OFIS
4,5,OFIS,90000380,90000194,7.BÖLGE,YEDEK OFIS,3.0,90000194,KAT: 1,4,OFIS
...,...,...,...,...,...,...,...,...,...,...,...
26340,26341,KNTYNR,90027484,90004209,2.BÖLGE,SHELTER 395+175,26252.0,90004209,FILYOS,34,KNTYNR
26341,26342,KNTYNR,90027485,90004209,2.BÖLGE,SHELTER 390+336,26252.0,90004209,FILYOS,34,KNTYNR
26342,26343,0IST,90004210,<NA>,2.BÖLGE,GOKCELER,NaN,NaN,NaN,1,0IST
26343,26344,SALON,90004184,90004210,2.BÖLGE,YOLCU BEKLEME SALONU,26343.0,90004210,GOKCELER,27,SALON
26344,26345,PERON,90004207,90004210,2.BÖLGE,PERON,26343.0,90004210,GOKCELER,55,PERON

In [671]:
regions = emlakverileri["Region"].unique()
regions = {'name': regions}
regions = pd.DataFrame(regions)
regions.dropna()
regions = regions.sort_values(by=['name']).dropna()
regions.reset_index(inplace=True)
regions = regions[["name"]]
regions.index += 1
regions = regions.reset_index(names="region_id")
regions = regions.rename(columns={'name': 'region_name'})
regions

   region_id    region_name
0          1        1.BÖLGE
1          2        2.BÖLGE
2          3        3.BÖLGE
3          4        4.BÖLGE
4          5        6.BÖLGE
5          6        7.BÖLGE
6          7  8.BÖLGE (YHT)
7          8    BASKENT RAY

In [672]:
merged = merged.merge(regions, left_on="Region", right_on="region_name", how="left")
merged

,id,Type,ref_code,ParentCode,Region,name_x,parent_id,Code_y,LocName_y,type_spec_id,name_y,region_id,region_name
0,1,0IST,90000304,<NA>,7.BÖLGE,KARAKUYU TESIS,NaN,NaN,NaN,1,0IST,6.0,7.BÖLGE
1,2,0BIN,90000320,90000304,7.BÖLGE,GAR BINASI,1.0,90000304,KARAKUYU TESIS,2,0BIN,6.0,7.BÖLGE
2,3,KAT,90000194,90000320,7.BÖLGE,KAT: 1,2.0,90000320,GAR BINASI,3,KAT,6.0,7.BÖLGE
3,4,OFIS,90000188,90000194,7.BÖLGE,YEDEK OFIS,3.0,90000194,KAT: 1,4,OFIS,6.0,7.BÖLGE
4,5,OFIS,90000380,90000194,7.BÖLGE,YEDEK OFIS,3.0,90000194,KAT: 1,4,OFIS,6.0,7.BÖLGE
...,...,...,...,...,...,...,...,...,...,...,...,...,...
26340,26341,KNTYNR,90027484,90004209,2.BÖLGE,SHELTER 395+175,26252.0,90004209,FILYOS,34,KNTYNR,2.0,2.BÖLGE
26341,26342,KNTYNR,90027485,90004209,2.BÖLGE,SHELTER 390+336,26252.0,90004209,FILYOS,34,KNTYNR,2.0,2.BÖLGE
26342,26343,0IST,90004210,<NA>,2.BÖLGE,GOKCELER,NaN,NaN,NaN,1,0IST,2.0,2.BÖLGE
26343,26344,SALON,90004184,90004210,2.BÖLGE,YOLCU BEKLEME SALONU,26343.0,90004210,GOKCELER,27,SALON,2.0,2.BÖLGE
26344,26345,PERON,90004207,90004210,2.BÖLGE,PERON,26343.0,90004210,GOKCELER,55,PERON,2.0,2.BÖLGE

In [673]:
merged = merged.rename(columns={'name_x': 'name'})
merged = merged[["id", "name", "type_spec_id", "parent_id", "region_id", "ref_code"]]
merged.index += 1
merged = merged.astype({"parent_id": 'Int64',"region_id": 'Int64'})
merged_with_id = merged[["id", "name", "type_spec_id", "parent_id", "region_id", "ref_code"]]
merged = merged[["id","name", "type_spec_id", "parent_id", "region_id", "ref_code"]]

locs = merged_with_id[merged_with_id["parent_id"] > merged_with_id["id"]].index
merged = merged.drop(locs)
for ii in range(10):
    merged = merged[merged["parent_id"].isin(merged["id"]) | merged["parent_id"].isna()]
merged

,id,name,type_spec_id,parent_id,region_id,ref_code
1,1,KARAKUYU TESIS,1,<NA>,6,90000304
2,2,GAR BINASI,2,1,6,90000320
3,3,KAT: 1,3,2,6,90000194
4,4,YEDEK OFIS,4,3,6,90000188
5,5,YEDEK OFIS,4,3,6,90000380
...,...,...,...,...,...,...
26341,26341,SHELTER 395+175,34,26252,2,90027484
26342,26342,SHELTER 390+336,34,26252,2,90027485
26343,26343,GOKCELER,1,<NA>,2,90004210
26344,26344,YOLCU BEKLEME SALONU,27,26343,2,90004184
26345,26345,PERON,55,26343,2,90004207

In [637]:
merged = merged[["name", "type_spec_id", "parent_id", "region_id", "ref_code"]]

In [674]:
merged.to_sql('independent_section',con=engine, if_exists='append', index=False)

327

In [653]:
merged.loc[merged["parent_id"] > merged["id"]]

Empty DataFrame
Columns: [id, name, type_spec_id, parent_id, region_id, ref_code]
Index: []

In [654]:
merged[merged["id"]==19380]

Empty DataFrame
Columns: [id, name, type_spec_id, parent_id, region_id, ref_code]
Index: []

In [583]:
locs = merged_with_id[merged_with_id["parent_id"] > merged_with_id["id"]].index
paren = merged_with_id.drop(locs)
paren[paren["parent_id"]>paren["id"]]

Empty DataFrame
Columns: [id, name, type_spec_id, parent_id, region_id, ref_code]
Index: []

In [570]:
merged_with_id.dtypes

id               int64
name            object
type_spec_id     int64
parent_id        Int64
region_id        Int64
ref_code        object
dtype: object

In [640]:
merged.iloc[[19380]]

                      name  type_spec_id  parent_id  region_id  ref_code
19388  CER POSTA AKU ODASI            54      19387          2  90005046

In [29]:
emlakverileri = pd.read_excel(r'/Users/aliosmanyilmaz/Downloads/emlakverileri.xlsx');
emlakverileri.head()

/Users/aliosmanyilmaz/opt/anaconda3/lib/python3.9/site-packages/openpyxl/worksheet/_read_only.py:79: UserWarning: Web Extension extension is not supported and will be removed
  for idx, row in parser.parse():

,LocID,User,Project,Part,Lat,Long,Start,Stop,Facility Code,Hiyerarşi,...,Sütun7,HType,LStatus,PicInfo,LastFlag,LastTS,Region,Code8,Sütun8,Sütun9
0,20470,102,TCDD,FAZ-1,38.077677,30.208332,30/04/2021 13:41:41,30/04/2021 13:43:43,90000304,90000304,...,NaN,T-TCDD,FAAL,LO-TCDD-FAZ-1-102-20210430134141,NaN,NaN,7.BÖLGE,NaN,NaN,NaN
1,20471,101,TCDD,FAZ-1,38.077677,30.208332,30/04/2021 13:41:41,30/04/2021 13:47:47,90000304,90000304-90000320,...,NaN,T-TCDD,FAAL,LO-TCDD-FAZ-1-101-20210430134141,NaN,NaN,7.BÖLGE,NaN,NaN,NaN
2,20485,101,TCDD,FAZ-1,38.07752252,30.2082382,30/04/2021 14:40:40,30/04/2021 14:50:50,90000304,90000304-90000320-90000194,...,NaN,T-TCDD,FAAL,LO-TCDD-FAZ-1-101-20210430144040,NaN,NaN,7.BÖLGE,NaN,NaN,NaN
3,20488,101,TCDD,FAZ-1,38.0776306666667,30.2079466666667,30/04/2021 14:51:51,30/04/2021 14:52:52,90000304,90000304-90000320-90000194-90000188,...,NaN,T-TCDD,FAAL,LO-TCDD-FAZ-1-101-20210430145151,NaN,NaN,7.BÖLGE,NaN,NaN,NaN
4,20487,101,TCDD,FAZ-1,38.0776306666667,30.2079466666667,30/04/2021 14:50:50,30/04/2021 14:51:51,90000304,90000304-90000320-90000194-90000380,...,NaN,T-TCDD,FAAL,LO-TCDD-FAZ-1-101-20210430145050,NaN,NaN,7.BÖLGE,NaN,NaN,NaN

In [111]:
#Deed ekle
deed = emlakverileri[["Ada", "Parsel", "City", "TabanAlanı", "ToplamİnşaatAlanı", "FID"]]

In [112]:
deed = deed[deed["FID"].notna()]
deed = deed.rename(columns={'Ada': 'ada','Parsel': 'parsel','TabanAlanı': 'net_area','ToplamİnşaatAlanı': 'gross_area'})
deed.loc[deed["net_area"] == '1.752.70', "net_area"] = 1752.70
deed.head()

    ada  parsel            City net_area  gross_area        FID
1   0.0   430.0  AFYONKARAHISAR      228       329.0  bina.1321
17  0.0   430.0  AFYONKARAHISAR       34        34.0  bina.1324
20  0.0   430.0  AFYONKARAHISAR       15        15.0  bina.1308
24  0.0   430.0  AFYONKARAHISAR       18        18.0  bina.1316
25  0.0   430.0  AFYONKARAHISAR      129       129.0  bina.1323

In [113]:
cities=["Adana", "Adıyaman", "Afyonkarahisar", "Agri", "Amasya", "Ankara", "Antalya", "Artvin", "Aydın", "Balikesir", "Bilecik", "Bingöl", "Bitlis", "Bolu", "Burdur", "Bursa", "Canakkale", "Cankırı", "Corum", "Denizli", "Diyarbakir", "Edirne", "Elazıg", "Erzincan", "Erzurum", "Eskisehir", "Gaziantep", "Giresun", "Gümüshane", "Hakkari", "Hatay", "Isparta", "icel (Mersin)", "istanbul", "izmir", "Kars", "Kastamonu", "Kayseri", "Kirklareli", "Kirşehir", "Kocaeli", "Konya", "Kutahya", "Malatya", "Manisa", "Kahramanmaras", "Mardin", "Mugla", "Mus", "Nevsehir", "Nigde", "Ordu", "Rize", "Sakarya", "Samsun", "Siirt", "Sinop", "Sivas", "Tekirdag", "Tokat", "Trabzon", "Tunceli", "Sanlıurfa", "Usak", "Van", "Yozgat", "Zonguldak", "Aksaray", "Bayburt", "Karaman", "Kirikkale", "Batman", "Sirnak", "Bartın", "Ardahan", "Igdır", "Yalova", "Karabük", "Kilis", "Osmaniye", "Düzce"
]

cities = {'Name': cities}
cities = pd.DataFrame(cities)
cities.index += 1

cities.reset_index(inplace=True)
cities = cities.rename(columns = {'index':'city_id'})
cities["Name"] = cities["Name"].str.lower().str.upper()
cities

    city_id            Name
0         1           ADANA
1         2        ADIYAMAN
2         3  AFYONKARAHISAR
3         4            AGRI
4         5          AMASYA
..      ...             ...
76       77          YALOVA
77       78         KARABÜK
78       79           KILIS
79       80        OSMANIYE
80       81           DÜZCE

[81 rows x 2 columns]

In [114]:
deed_city = deed.merge(cities, left_on="City", right_on="Name", how="left")
deed_city = deed_city.astype({"ada": 'Int64',"parsel": 'Int64',"city_id": 'Int64', 'net_area':'float'})
deed_city_fid = deed_city.drop(['City','Name'], axis=1)
deed_city = deed_city_fid.drop("FID", axis=1)
deed_city.index += 1
deed_city

      ada  parsel  net_area  gross_area  city_id
1       0     430     228.0       329.0        3
2       0     430      34.0        34.0        3
3       0     430      15.0        15.0        3
4       0     430      18.0        18.0        3
5       0     430     129.0       129.0        3
...   ...     ...       ...         ...      ...
1157  102       1       0.0        60.0       67
1158  102       1       0.0        20.0       67
1159  102       1       0.0       150.0       67
1160  102       1       0.0       175.0       67
1161  107       3       0.0        50.0       67

[1161 rows x 5 columns]

In [115]:
deed_city.dtypes

ada             Int64
parsel          Int64
net_area      float64
gross_area    float64
city_id         Int64
dtype: object

In [116]:
deed_city.to_sql('deed',con=engine, if_exists='append', index_label='id')

161

In [1]:
deed_city

NameError: name 'deed_city' is not defined